#include <stdio.h>

// 1. dfs로 그대로 출력 v
// 2. 세로줄만 중복이 아닌 상태로 출력
// 3. 가로, 세로 중복이 아닌 상태로 출력
// 4. 추가로 3x3칸도 중복이 아닌 상태로 출력

void dfs(int n, int (*sudoku)[9]) {
    int i, j;
    // 
    
    for(i=0; i<9; i++) {
        for(j=0; j<9; j++) {
            printf("%d ", sudoku[i][j]);
        }
        printf("\n");
    }
}

int check[10]={0,}; // x가 존재하면 check[x]의 값을 1로, 없으면 0

int main() {
    int i, j, sudoku[9][9];
    for(i=0; i<9; i++) {
        for(j=0; j<9; j++) {
            scanf("%d", &sudoku[i][j]);
        }
    }
    printf("\n"); // delete
    dfs(0, sudoku);
}

// 0 3 5 4 6 9 2 7 8
// 7 8 2 1 0 5 6 0 9
// 0 6 0 2 7 8 1 3 5
// 3 2 1 0 4 6 8 9 7
// 8 0 4 9 1 3 5 0 6
// 5 9 6 8 2 0 4 1 3
// 9 1 7 6 5 2 0 8 0
// 6 0 3 7 0 1 9 5 2
// 2 5 8 3 9 4 7 6 0

// [00][01][02][03][04][05][06][07][08]
// [10][11][12][13][14][15][16][17][18]

// 1. [n,0]이 들어옴
// 2. 만약 [n,0]이 [n-1,0] 값과 같으면 return
// 3. for문으로 dfs(n+1, sudoku) 실행