import sys

if __name__ == "__main__":
    t = int(sys.stdin.readline())
    for i in range(t):
        li = list(map(int, sys.stdin.readline().split()))
        cnt = -1
        final = li[1]-1 # 마지막 공간이동을 해야 하는 위치
        for k in range(li[0], li[1]+1):
            if k!=li[0]: k+=2; print('d')
            print(f'k:{k}')
            cnt+=1
        print(f'cnt:{cnt}')
        
    # cnt = 0
    # k = 0
    
    # 처음과 마지막은 무조건 거리 1
    # 0 2 = 2 :: 0 1 2 - 1 1
    # 0 3 = 3 :: 0 1 2 3 - 1 1 1
    # 0 4 = 3 :: 0 1 3 4 - 1 2 1
    # 0 5 = 4 :: 0 1 3 4 5 - 1 2 1 1
    # 0 6 = 4 :: 0 1 3 5 6 - 1 2 2 1
    # 0 7 = 5 :: 0 1 3 5 6 7 - 1 2 2 1 1
    # 0 8 = 5 :: 0 1 3 5 7 8 - 1 2 2 2 1
    # 0 9 = 6 :: 0 1 3 6 8 9 - 1 2 3 2 1
    # 0 10 = 6 :: 0 1 3 6 8 9 10 - 1 2 3 2 1 1
    # 0 11 = 6 :: 0 1 3 6 8 10 11 - 1 2 3 2 2 1
    # 0 12 = 6 :: 0 1 3 6 9 11 12 - 1 2 3 3 2 1
    # 0 13 = 7 :: 0 1 3 6 9 11 12 13 - 1 2 3 3 2 1 1
    
    # 45 50 = 4 :: 45 46 48 49 50
    # 0 12 = ? :: 0 1 3 6 